### CRF ###
force_backward: true
name: "CRF"

input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 500
  dim: 500
}

input: "coarse"
input_shape {
  dim: 1
  dim: 2
  dim: 500
  dim: 500
}

input: "label"
input_shape {
  dim: 1
  dim: 1
  dim: 500
  dim: 500
}

layer { 
  #type: SPLIT 
  type: "Split"
  name: 'splitting'
  bottom: 'coarse' top: 'unary' top: 'Q0'
}

layer {
  name: "inference1"
  #type: MULTI_STAGE_MEANFIELD
  type: "MultiStageMeanfield"
  bottom: "unary"
  bottom: "Q0"
  bottom: "data"
  top: "pred"
  #param { lr_mult: 0.001 }
  #param { lr_mult: 0.001 }
  #param { lr_mult: 0.01 }
  param { lr_mult: 10000 }
  param { lr_mult: 10000 }
  param { lr_mult: 1000 }
  #blobs_lr: 0.001
  #blobs_lr: 0.001
  #blobs_lr: 0.01 #new parameter
  #blobs_lr: 10000 
  #blobs_lr: 10000 
  #blobs_lr: 1000 #new parameter
  multi_stage_meanfield_param {
   num_iterations: 10
   compatibility_mode: POTTS
   threshold: 2
   theta_alpha: 160
   theta_beta: 3
   theta_gamma: 3
   #spatial_filter_weight: 3
   #bilateral_filter_weight: 5
   spatial_filter_weights_str: "3 3"
   bilateral_filter_weights_str: "5 5"
  }
}

layer { 
  #type: SOFTMAX_LOSS 
  type: "SoftmaxWithLoss"
  name: 'loss' 
  top: 'loss'
  bottom: 'pred' 
  bottom: 'label'
  loss_param { normalize: false }
}

layer { type: "Softmax" name: 'softmax' bottom: 'pred' top: 'softmax' include { phase: TEST}}
